michelesponchiado/CC2650_fw_update/src/sblAppEx.cpp
	if (fd_reset_low >= 0)
	{
		close(fd_reset_low);
	}
	if (fd_boot_enable_high >= 0)
	{
		close(fd_boot_enable_high);
	}

	syslog(LOG_INFO, "-%s returns is_OK = %u\n", __func__, is_OK);
	return	is_OK;
}

#if 0
static int64_t get_current_epoch_time_ms(void)
{
	struct timeb timer_msec;
	int64_t timestamp_msec; // timestamp in milliseconds
	if (!ftime(&timer_msec))
	{
		timestamp_msec = ((long long int) timer_msec.time) * 1000ll +	(long long int) timer_msec.millitm;
	}
	else
	{
		timestamp_msec = -1;
	}
	return timestamp_msec;
}
#endif


//
// Including functions for millisecond precision timing.
// Taken from http://stackoverflow.com/questions/2494356/how-to-use-gettimeofday-or-something-equivalent-with-visual-studio-c-2008
//
#include <time.h>


// Calculate crc32 checksum the way CC2538 and CC2650 does it.
static uint32_t calcCrcLikeChip(const unsigned char *pData, unsigned long ulByteCount)
{
    uint32_t d, ind;
    uint32_t acc = 0xFFFFFFFF;
    const uint32_t ulCrcRand32Lut[] =
    {
        0x00000000, 0x1DB71064, 0x3B6E20C8, 0x26D930AC, 
        0x76DC4190, 0x6B6B51F4, 0x4DB26158, 0x5005713C, 
        0xEDB88320, 0xF00F9344, 0xD6D6A3E8, 0xCB61B38C, 
        0x9B64C2B0, 0x86D3D2D4, 0xA00AE278, 0xBDBDF21C
    };

    while ( ulByteCount-- )
    {
        d = *pData++;
        ind = (acc & 0x0F) ^ (d & 0x0F);
        acc = (acc >> 4) ^ ulCrcRand32Lut[ind];
        ind = (acc & 0x0F) ^ (d >> 4);
        acc = (acc >> 4) ^ ulCrcRand32Lut[ind];
    }

    return (acc ^ 0xFFFFFFFF);
}

/// Application status function (used as SBL status callback)
static void appStatus(char *pcText, bool bError)
{
    if(bError)
    {
    	syslog(LOG_ERR, "%s", pcText);
    }
    else
    {
    	syslog(LOG_INFO, "%s", pcText);
    }
}


/// Application progress function (used as SBL progress callback)
static void appProgress(uint32_t progress)
{
	//syslog(LOG_INFO, "\r%d%% ", progress);
}

// Defines
#define DEVICE_CC2538				0x2538
#define DEVICE_CC26XX				0x2650
#define CC2538_FLASH_BASE			0x00200000
#define CC26XX_FLASH_BASE			0x00000000
#ifndef OLINUXINO_LIB
static void my_at_exit(void)
{
	// at exit, close the system log
	closelog();
}
#endif

#ifdef OLINUXINO_LIB
extern "C" enum_do_CC2650_fw_update_retcode do_CC2650_fw_update(const char *path_binary_file)
#else
enum_do_CC2650_fw_update_retcode do_CC2650_fw_update(const char *path_binary_file)
#endif
{
	enum_do_CC2650_fw_update_retcode r = enum_do_CC2650_fw_update_retcode_OK;
#ifndef OLINUXINO_LIB
	open_syslog();
	atexit(my_at_exit);
#endif
	syslog(LOG_INFO, "%s + starts", __func__);


	//
	// START: Program Configuration
	//
	/* Device type. (Binary-coded decimal of the device
	     e.g. 0x2538 for CC2538 and 0x2650 for CC2650) */
	uint32_t deviceType = 0x2650;

	//
	// END: Program configuration
	//

	SblDevice *pDevice = NULL;		// Pointer to SblDevice object
	std::string fileName;			// File name to program
	uint32_t byteCount = 0;			// File size in bytes
    uint32_t fileCrc, devCrc;		// Variables to save CRC checksum
	uint32_t devFlashBase;	    	// Flash start address
	static std::vector<char> pvWrite(1);// Vector to application firmware in.
	static std::ifstream file;		// File stream


	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (!is_OK_do_CC2650_reset(1))
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_reset_chip;
	    	syslog(LOG_ERR, "ERR_unable_to_reset_chip");
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		fileName = path_binary_file;
		devFlashBase = CC26XX_FLASH_BASE;

		//
		// Set callback functions
		//
		SblDevice::setCallBackStatusFunction(&appStatus);
		SblDevice::setCallBackProgressFunction(&appProgress);

		//
		// Create SBL object
		//
		pDevice = SblDevice::Create(deviceType);
		if(pDevice == NULL)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_create_SBL_object;
	    	syslog(LOG_ERR, "ERR_unable_to_create_SBL_object");
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		//
		// Connect to device
		//
		syslog(LOG_INFO, "Opening the serial port %s", def_selected_serial_port);
		if(pDevice->connect(def_selected_serial_port, false) != SBL_SUCCESS)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_connect_with_the_chip;
			syslog(LOG_INFO, "Opening the serial port %s something went wrong", def_selected_serial_port);
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		//
		// Read file
		//
		syslog(LOG_INFO, "Opening the file %s", fileName.c_str());
		file.open(fileName.c_str(), std::ios::binary);
		if( ! file.is_open())
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_open_the_firmware_file;
			syslog(LOG_ERR, "unable to open the file %s", fileName.c_str());
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		//
		// Get file size:
		//
		file.seekg(0, std::ios::end);
		if (file.fail())
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_seek_to_the_file_end;
			//cout << "Unable to open file " << fileName.c_str();
			syslog(LOG_ERR, "unable to seek to the very end of the file");
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		byteCount = (uint32_t)file.tellg();
		if (file.fail())
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_get_filesize;
			syslog(LOG_ERR, "unable to get the file size");
		}
		else
		{
			syslog(LOG_INFO, "Number of bytes in the file: %u", byteCount);
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		file.seekg(0, std::ios::beg);
		if (file.fail())
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_seek_where_the_file_begins;
			syslog(LOG_ERR, "unable to seek to the begin of the file");
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		//
		// Read data
		//
		try
		{
			pvWrite.resize(byteCount);
		}
		catch (std::bad_alloc const&)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_allocate_the_read_buffer;
			syslog(LOG_ERR, "unable to allocate the read buffer");
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		file.read((char*) &pvWrite[0], byteCount);
		if (file.fail())
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_read_the_whole_file;
			syslog(LOG_ERR, "unable to read the whole file");
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		file.close();
		if (file.fail())
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_close_the_file;
			syslog(LOG_ERR, "unable to close the file");
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (byteCount <= sizeof(type_ASACZ_CC2650_fw_update_header))
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_filesize_too_small;
			syslog(LOG_ERR, "the file size is too small to contain both header and body");
		}
	}

	type_ASACZ_CC2650_fw_update_header * p_header = (type_ASACZ_CC2650_fw_update_header *)&pvWrite[0];
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		uint32_t calc_crc_header = calcCrcLikeChip((unsigned char *)p_header, sizeof(type_ASACZ_CC2650_fw_update_header) - sizeof(p_header->header_CRC32_CC2650));
		if (calc_crc_header != p_header->header_CRC32_CC2650)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_invalid_header_CRC32;
			syslog(LOG_ERR, "header has invalid header CRC : calculated is 0x%08X, header has 0x%08X", calc_crc_header, p_header->header_CRC32_CC2650);
		}
		else
		{
			syslog(LOG_INFO, "magic key  %s"	, p_header->magic_name);
			syslog(LOG_INFO, "ASCII ver. %s"	, p_header->ascii_version_number);
			syslog(LOG_INFO, "date       %s"	, p_header->date);
			syslog(LOG_INFO, "fw version %u.%u.%u"	, p_header->fw_version_major, p_header->fw_version_middle, p_header->fw_version_minor);
			syslog(LOG_INFO, "body size  %u"		, p_header->firmware_body_size);
			syslog(LOG_INFO, "BODY CRC   0x%08X"	, p_header->firmware_body_CRC32_CC2650);
			syslog(LOG_INFO, "header CRC 0x%08X"	, p_header->header_CRC32_CC2650);
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (strcmp((const char*)p_header->magic_name, (const char*)def_magic_name_ASACZ_CC2650_fw_update_header))
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_invalid_header_magic_key;
			syslog(LOG_ERR, "header has invalid magic name %s", (const char*)p_header->magic_name);
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (p_header->firmware_body_size + sizeof(type_ASACZ_CC2650_fw_update_header) != byteCount)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_invalid_body_size;
			syslog(LOG_ERR, "header has invalid body size; expected %u, read %u", p_header->firmware_body_size, (unsigned int)(byteCount - sizeof(type_ASACZ_CC2650_fw_update_header)));
		}
	}

	unsigned char * p_firmware_body = (unsigned char *)&pvWrite[0] + sizeof(type_ASACZ_CC2650_fw_update_header);
	uint32_t body_size = p_header->firmware_body_size;
	//
	// Calculate file CRC checksum
	//
	fileCrc = calcCrcLikeChip(p_firmware_body, body_size);

