michelesponchiado/CC2650_fw_update/src/sblAppEx.cpp
		time_t rawtime;
		struct tm * timeinfo;

		time (&rawtime);
		timeinfo = localtime (&rawtime);
		int n = snprintf((char *)ASACZ_CC2650_fw_update_header.ascii_version_number, sizeof(ASACZ_CC2650_fw_update_header.ascii_version_number), "%u.%u.%u",
				ASACZ_CC2650_fw_update_header.fw_version_major,
				ASACZ_CC2650_fw_update_header.fw_version_middle,
				ASACZ_CC2650_fw_update_header.fw_version_minor
				);
		if (n >= (int)sizeof(ASACZ_CC2650_fw_update_header.ascii_version_number))
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_sprint_ascii_version_number;
		}
		else if (!strftime ((char *)ASACZ_CC2650_fw_update_header.date, sizeof(ASACZ_CC2650_fw_update_header.date), "%Y %b %d",timeinfo))
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_sprint_date;
		}
		else
		{
			printf("Header info:\n");
			printf("\t magic key  %s\n"	, ASACZ_CC2650_fw_update_header.magic_name);
			printf("\t ASCII fw   %s\n"	, ASACZ_CC2650_fw_update_header.ascii_fw_type);
			printf("\t ASCII ver. %s\n"	, ASACZ_CC2650_fw_update_header.ascii_version_number);
			printf("\t ASCII date %s\n"	, ASACZ_CC2650_fw_update_header.date);
			printf("\t fw type    %u\n"	, ASACZ_CC2650_fw_update_header.fw_type);
			printf("\t fw version %u.%u.%u\n"	, ASACZ_CC2650_fw_update_header.fw_version_major, ASACZ_CC2650_fw_update_header.fw_version_middle, ASACZ_CC2650_fw_update_header.fw_version_minor);
			printf("\t body size  %u\n"			, ASACZ_CC2650_fw_update_header.firmware_body_size);
			printf("\t body CRC   0x%08X\n"		, ASACZ_CC2650_fw_update_header.firmware_body_CRC32_CC2650);
		}
	}
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		int header_CRC_size = sizeof(ASACZ_CC2650_fw_update_header) - sizeof(ASACZ_CC2650_fw_update_header.header_CRC32_CC2650);
		ASACZ_CC2650_fw_update_header.header_CRC32_CC2650 = calcCrcLikeChip((const unsigned char *)&ASACZ_CC2650_fw_update_header, header_CRC_size);
		printf("\t header CRC 0x%08X\n"	, ASACZ_CC2650_fw_update_header.header_CRC32_CC2650);
	}
	char outfile_name[1024];
	memset(outfile_name, 0, sizeof(outfile_name));
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		int n = snprintf(outfile_name, sizeof(outfile_name), "ASACZ_CC2650fw_%s.%u_%u_%u"
				, ASACZ_CC2650_fw_update_header.ascii_fw_type
				, ASACZ_CC2650_fw_update_header.fw_version_major
				, ASACZ_CC2650_fw_update_header.fw_version_middle
				, ASACZ_CC2650_fw_update_header.fw_version_minor
				);
		if (n >= (int)sizeof(outfile_name))
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_sprint_output_filename;
		}
		else
		{
			fout = fopen(outfile_name, "wb");
			if (!fout)
			{
				r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_open_output_file;
			}
		}
	}
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		size_t n = fwrite(&ASACZ_CC2650_fw_update_header, sizeof(ASACZ_CC2650_fw_update_header), 1, fout);
		if (n != 1)
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_write_header;
		}
	}
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		size_t n = fwrite(p_bin_file_body, l_filesize, 1, fout);
		if (n != 1)
		{
			r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_write_body;
		}
	}
	if (fout)
	{
		if (fclose(fout))
		{
			if (r == enum_ASACZ_CC2650fw_retcode_OK)
			{
				r = enum_ASACZ_CC2650fw_retcode_ERR_unable_to_close_output_file;
			}
		}
	}
	if (r == enum_ASACZ_CC2650fw_retcode_OK)
	{
		printf("Output generated OK to %s\n", outfile_name);
	}
	else
	{
		printf("Error %u\n", (uint32_t)r);
		printf("Syntax: %s <binary file> <firmware type> <major> <middle> <minor>\n", argv[0] );
		printf("<binary file> must contain the firmware");
		printf("\t <firmware type> is in ");
		{
			unsigned int i;
			for (i = 0; i < sizeof(fw_types_OK)/sizeof(fw_types_OK[0]); i++)
			{
				printf("%s ", fw_types_OK[i]);
			}
		}
		printf("\n");
		printf("<major> <middle> <minor> must be between 0 and 255");
	}
	return r;
}
#endif
